---
type: IDockablePaneProvider
namespace: Autodesk.Revit.UI
version: 2024
members: 1
tags: [revit-api, class]
---

# IDockablePaneProvider

`Autodesk.Revit.UI.IDockablePaneProvider` · Revit 2024 · 1 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | SetupDockablePane | 2014 | `void SetupDockablePane ( DockablePaneProviderData data )` |